src/Catalogs/ПлощадкиЭксплуатации/ПлощадкиЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПлощадкиЭксплуатации</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ЕдиницаКонтроля</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.Публикации</types>
      <types>CatalogRef.Оборудование</types>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЭлемента</name>
    <type>
      <types>EnumRef.ТипЭлементаПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Площадка</name>
    <type>
      <types>CatalogRef.ПлощадкиЭксплуатации</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/НастройкиСборДампов/НастройкиСборДампов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиСборДампов</name>
  <resources>
    <name>КаталогТЖСетевой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогТЖЛокальный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлительностьХраненияФайловТЖ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогВыгрузкиДамповСетевой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогВыгрузкиДампов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогВременныхФайлов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УровеньДетализацииДампов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АвтоматическаяНастройка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьАгента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Расписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>КонтрольнаяПроцедура</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.ВидыКонтрольныхПроцедур</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ПлощадкиЭксплуатации/Forms/ФормаГруппыКонтрольУстойчивости/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
        ЭтотОбъект.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;
        ЭтотОбъект.Элементы.Наименование.Видимость = Ложь;
        ЭтотОбъект.Элементы.ГруппаКоманднаяПанельНастройкиПоУмолчанию.Видимость = Истина;
        ЭтотОбъект.Элементы.ЗаписатьИЗАкрытьМоя.КнопкаПоУмолчанию = Истина;
    КонецЕсли;
    
    ЗаполнитьНастройкиПоУмолчанию();
    
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    ЗаписатьНастройкиПоУмолчанию();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрытьМоя(Команда)
    
    ЗаписатьНастройкиПоУмолчанию();
    ЭтотОбъект.Закрыть();
    
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьМоя(Команда)
    ЗаписатьНастройкиПоУмолчанию();
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    
    Диалог = Новый ДиалогРасписанияРегламентногоЗадания(ЭтотОбъект.Расписание);
	Диалог.Показать(Новый ОписаниеОповещения("ОткрытьРасписаниеЗавершение", ЭтотОбъект));
    
    СтандартнаяОбработка = Ложь;
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНастройкиПоУмолчанию()
    
    Настройки = РегистрыСведений.НастройкиСборДампов.ПрочитатьНастройки(Справочники.ВидыКонтрольныхПроцедур.КонтрольУстойчивостиСистемы());
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "КаталогЭкспортаДампов";
    НовСтрока.ПараметрПредставление = "Каталог экспорта дампов";
    НовСтрока.ПараметрЗначение = Настройки.КаталогЭкспортаДампов;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "ИспользоватьАгента";
    НовСтрока.ПараметрПредставление = "Использовать агента";
    НовСтрока.ПараметрЗначение = Настройки.ИспользоватьАгента;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "КаталогВременныхФайлов";
    НовСтрока.ПараметрПредставление = "Каталог временных файлов";
    НовСтрока.ПараметрЗначение = Настройки.КаталогВременныхФайлов;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "КаталогВыгрузкиДампов";
    НовСтрока.ПараметрПредставление = "Каталог выгрузки дампов локальный";
    НовСтрока.ПараметрЗначение = Настройки.КаталогВыгрузкиДампов;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "КаталогВыгрузкиДамповСетевой";
    НовСтрока.ПараметрПредставление = "Каталог выгрузки дампов сетевой";
    НовСтрока.ПараметрЗначение = Настройки.КаталогВыгрузкиДамповСетевой;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "АвтоматическаяНастройка";
    НовСтрока.ПараметрПредставление = "Автоматическая настройка технологического журнала";
    НовСтрока.ПараметрЗначение = Настройки.АвтоматическаяНастройка;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "КаталогТЖЛокальный";
    НовСтрока.ПараметрПредставление = "Каталог данных ТЖ локальный";
    НовСтрока.ПараметрЗначение = Настройки.КаталогТЖЛокальный;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "КаталогТЖСетевой";
    НовСтрока.ПараметрПредставление = "Каталог данных ТЖ сетевой";
    НовСтрока.ПараметрЗначение = Настройки.КаталогТЖСетевой;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "УровеньДетализацииДампов";
    НовСтрока.ПараметрПредставление = "Уровень детализации дампов";
    НовСтрока.ПараметрЗначение = Настройки.УровеньДетализацииДампов;
    
    НовСтрока = ПараметрыПоУмолчанию.Добавить();
    НовСтрока.Параметр = "ДлительностьХраненияФайловТЖ";
    НовСтрока.ПараметрПредставление = "Длительность хранения ТЖ, часов";
    НовСтрока.ПараметрЗначение = Настройки.ДлительностьХраненияФайловТЖ;
    
    ЭтотОбъект.Расписание = Настройки.Расписание;
    Если ЭтотОбъект.Расписание = Неопределено Тогда
        ЭтотОбъект.Расписание = Новый РасписаниеРегламентногоЗадания;
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиПоУмолчанию()
    
    Настройки = Новый Структура;
    
    Для Каждого ТекПараметр Из ПараметрыПоУмолчанию Цикл
        Настройки.Вставить(ТекПараметр.Параметр, ТекПараметр.ПараметрЗначение);
    КонецЦикла;
    
    Настройки.Вставить("Расписание", ЭтотОбъект.Расписание);
    
    РегистрыСведений.НастройкиСборДампов.ЗаписатьНастройки(Справочники.ВидыКонтрольныхПроцедур.КонтрольУстойчивостиСистемы(), Настройки);
        
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРасписаниеЗавершение(НовоеРасписание, Неопределен) Экспорт
    
    Если НовоеРасписание <> Неопределено Тогда
		ЭтотОбъект.Расписание = НовоеРасписание;
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти
